{
	"nfuller" : {
		"about": "Nathan worked on both aspects of the web application. That is, the front end and the back end. As for his contributions to the back end, he focused more on user session management and route handling, specifically with user login and sign up. In the front end, Nathan worked with Dan to create starter Handlebars templates, css styles, and front-end functionality with jQuery.\nOne of the later contributions made by Nathan to QueueUp involved refactoring some logic for OAuth2 that existed in the /routes/user.js file. He felt that cleaner code could be achieved by extracting shared code from the user.js and oauth2.js routes into /lib/oauth2.js. This helped prevent duplicated code and also added a level of abstraction between specific routes and their interaction with the database."
	},

	"dlazier" : {
		"about": "Dan contributed to mainly the front and some back end of the application.For the backend Dan worked with Zhi and Nate on backend user account creation. Helped decide and implement user account database and password encryption. For the front end Dan helped research and decide on front end frameworks and design layouts. Dan also worked with Nathan create handlebars templates and css styles, and implement front end functionality with jquery. In addition to this Dan worked with Zhi to get video information from youtube API to load videos into a user’s queue."
	},

	"abradley" : {
		"about": "Adam began by researching technologies that QueueUp uses, such as MongoDB, Node, and Express. He has strong object-oriented programming experience, so he assisted with some of the backend work. Adam worked with Nate on tasks such as routing logic for when the user navigates QueueUp (where to send the user when they click, “login”, “signup”, “logout”, etc.). Without much experience in frontend design, Adam took this project as an opportunity to learn about the styling in languages like CSS and connecting the backend to the frontend. He pair-programmed with Dan and helped with implementing styling elements such as the layout and color scheme of QueueUp. Adam also helped by collaborating on documentation for the project."
	},

	"cgiang" : {
		"about": "Co worked mainly with the front end of the web application. He researched use of front end frameworks to assist with data binding, as well as ways to make the user interface appear as fluid as possible to provide a pleasurable user experience. He also worked with the signup page design and functionality and overall website design as well as helping with the documentation."
	},

	"zhili" : {
		"about": "Zhi had been working mainly with the backend implementation, using technologies including MongoDB, Node, and Express. He had performed research on MongoDB, Node, and Express, and implemented the basic and user libraries for database interactions used in QueueUp and encryption using the crypto library. Zhi had also helped implement interactions with YouTube, more precisely the video list from YouTube."
	},

	"kfarr" : {
		"about": "Kevin focused primarily on getting YouTube integration up and running, so he researched the various libraries available for Node and JavaScript to facilitate this integration, as well as the APIs provided by Google for using their OAuth 2.0 security protocol, and the YouTube APIs for performing queries and understanding the baffling response objects that Google sends.\nIn implementation, he first worked on the multi-stage process of getting user’s authorization tokens back from Google, and storing them in the database. Then, once the tokens were safely stored and usable, Kevin moved on to actually using them to access a user’s content from YouTube, and collaborated with the front-end designers to pass that content to them in a usable format. He also worked on some of the front-end display himself, creating the initial state of the dashboard, passing the authorization and deauthorization links to the profile page, and then actually coding those functions and making sure Google didn’t mess it all up for everyone (as per usual)."
	}
}
